doc/testlist.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>testlist</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-07 Thu"/>
<meta name="author" content="Mirela Nicola"/>
<meta name="description" content="Augment design process with system property discovering aid."/>
<meta name="keywords" content="SmallCell, "/>
<link rel="stylesheet" type="text/css" href="org-manual.css" />
</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="sitemap.html"> UP </a>
 |
 <a accesskey="H" href="main.html"> HOME </a>
</div>

<h1 class="title">testlist</h1>





<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 RUN </a></li>
<li><a href="#sec-2">2 RPC protocol Unitary tests </a>
<ul>
<li><a href="#sec-2.1">2.1 Protocol </a>
<ul>
<li><a href="#sec-2.1.1">2.1.1 SOAP Parse tests </a></li>
</ul>
</li>
<li><a href="#sec-2.2">2.2 SOAP decoding [16/16] </a></li>
<li><a href="#sec-2.3">2.3 SOAP encoding [1/1] </a></li>
<li><a href="#sec-2.4">2.4 ACS location update [1/1] </a></li>
</ul>
</li>
<li><a href="#sec-3">3 System tests </a>
<ul>
<li><a href="#sec-3.1">3.1 Application state management [1/3] </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> RUN </h2>
<div class="outline-text-2" id="text-1">

<pre class="example">
watchfs '*/*.erl' 'rebar eunit -v skip_deps=true suite=xmerl'
</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> RPC protocol Unitary tests </h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> Protocol </h3>
<div class="outline-text-3" id="text-2.1">


<pre class="example">
list_to_atom(element(2, split_ns("soap:Envelope"))).
</pre>




</div>

<div id="outline-container-2.1.1" class="outline-4">
<h4 id="sec-2.1.1"><span class="section-number-4">2.1.1</span> SOAP Parse tests </h4>
<div class="outline-text-4" id="text-2.1.1">

<p>File souces are in: <a href="#https://github.com/dpavlin/perl-cwmp.git">perl-cwmp</a>
</p>
<ul>
<li id="sec-2.1.1.1">CPE Implementation <br/>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col"><i>CPE methods</i></th><th scope="col"><i>Responding</i></th><th scope="col"><i>Calling</i></th><th scope="col"><i>Implemented</i></th></tr>
</thead>
<tbody>
<tr><td>GetRPCMethods</td><td>REQUIRED</td><td>OPTIONAL</td><td>X</td></tr>
<tr><td>SetParameterValues</td><td>REQUIRED</td><td>REQUIRED</td><td>X</td></tr>
<tr><td>GetParameterValues</td><td>REQUIRED</td><td>REQUIRED</td><td>X</td></tr>
<tr><td>GetParameterNames</td><td>REQUIRED</td><td>REQUIRED</td><td>X</td></tr>
<tr><td>SetParameterAttributes</td><td>REQUIRED</td><td>OPTIONAL</td><td></td></tr>
<tr><td>GetParameterAttributes</td><td>REQUIRED</td><td>OPTIONAL</td><td>X</td></tr>
<tr><td>AddObject</td><td>REQUIRED</td><td>OPTIONAL</td><td></td></tr>
<tr><td>DeleteObject</td><td>REQUIRED</td><td>OPTIONAL</td><td></td></tr>
<tr><td>Reboot</td><td>REQUIRED</td><td>OPTIONAL</td><td>X</td></tr>
<tr><td>Download</td><td>REQUIRED</td><td>REQUIRED</td><td></td></tr>
<tr><td>ScheduleDownload</td><td>OPTIONAL</td><td>OPTIONAL</td><td></td></tr>
<tr><td>Upload</td><td>OPTIONAL</td><td>OPTIONAL</td><td></td></tr>
<tr><td>FactoryReset</td><td>OPTIONAL</td><td>OPTIONAL</td><td></td></tr>
<tr><td>GetQueuedTransfers  (DEPRECATED)</td><td>OPTIONAL</td><td>OPTIONAL</td><td></td></tr>
<tr><td>GetAllQueuedTransfers</td><td>OPTIONAL</td><td>OPTIONAL</td><td></td></tr>
<tr><td>CancelTransfer</td><td>OPTIONAL</td><td>OPTIONAL</td><td></td></tr>
<tr><td>ScheduleInform</td><td>OPTIONAL</td><td>OPTIONAL</td><td></td></tr>
<tr><td>ChangeDUState</td><td>OPTIONAL</td><td>OPTIONAL</td><td></td></tr>
<tr><td>SetVouchers           (DEPRECATED)</td><td>OPTIONAL</td><td>OPTIONAL</td><td></td></tr>
<tr><td>GetOptions            (DEPRECATED)</td><td>OPTIONAL</td><td>OPTIONAL</td><td></td></tr>
</tbody>
</table>



</li>
<li id="sec-2.1.1.2">ACS Implementation <br/>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col"><i>ACS methods</i></th><th scope="col"><i>Calling</i></th><th scope="col"><i>Responding</i></th><th scope="col"><i>Implemented</i></th></tr>
</thead>
<tbody>
<tr><td>GetRPCMethods</td><td>OPTIONAL</td><td>REQUIRED</td><td></td></tr>
<tr><td>Inform</td><td>REQUIRED</td><td>REQUIRED</td><td>X</td></tr>
<tr><td>TransferComplete</td><td>REQUIRED</td><td>REQUIRED</td><td></td></tr>
<tr><td>AutonomousTransferComplete</td><td>OPTIONAL</td><td>REQUIRED</td><td></td></tr>
<tr><td>DUStateChangeComplete</td><td>OPTIONAL</td><td>OPTIONAL</td><td></td></tr>
<tr><td>AutonomousDUStateChangeComplete</td><td>OPTIONAL</td><td>OPTIONAL</td><td></td></tr>
<tr><td>RequestDownload</td><td>OPTIONAL</td><td>OPTIONAL</td><td></td></tr>
<tr><td>Kicked                (DEPRECATED)</td><td>OPTIONAL</td><td>OPTIONAL</td><td></td></tr>
</tbody>
</table>




</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> SOAP decoding [16/16] </h3>
<div class="outline-text-3" id="text-2.2">

<ul>
<li>
<b>[X]</b> Parse SOAP boolean types
</li>
<li>
<b>[X]</b> Parse SOAP dateTime types 
</li>
<li>
<b>[X]</b> Parse SOAP int types
</li>
<li>
<b>[X]</b> Parse SOAP unsignedInt types
</li>
<li>
<b>[X]</b> Parse SOAP string types
</li>
<li>
<b>[X]</b> Parse ISO 8601 date time aka <a href="http://www.w3.org/TR/xmlschema-2/#dateTime">xs:dateTime</a>
</li>
<li>
<b>[X]</b> Check SOAP version from envelop

</li>
<li>
<b>[X]</b> Parse SOAP URI types
</li>
<li>
<b>[X]</b> Parse SOAP namespace types (copy from libs)

</li>
<li>
<b>[X]</b> parse_EventCodeType

</li>
<li>
<b>[X]</b> parse_ArraySize

</li>
<li>
<b>[X]</b> parse_FileType

</li>
<li>
<b>[X]</b> parse_FaultCode

</li>
<li>
<b>[X]</b> parse_Notification

</li>
<li>
<b>[X]</b> parse/format base64

</li>
<li>
<b>[X]</b> parse_WindowMode 
</li>
</ul>

<p>FEX: <a href="http://www.broadband-forum.org/technical/download/TR-069_Amendment-3.pdf">http://www.broadband-forum.org/technical/download/TR-069\_Amendment-3.pdf</a>
</p>

</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3"><span class="section-number-3">2.3</span> SOAP encoding [1/1] </h3>
<div class="outline-text-3" id="text-2.3">

<ul>
<li>
<b>[X]</b> build anyURI 


</li>
</ul>


<pre class="example">%%%  ftp_URL = "ftp:" "//" [ ftp_userinfo "@"] host [ ":" port ] ftp_abs_path
%%%  http_URL = "http:" "//" host [ ":" port ] [ abs_path [ "?" query ]]
%%%  http_URL = "https:" "//" host [ ":" port ] [ abs_path [ "?" query ]]
</pre>




</div>

</div>

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4"><span class="section-number-3">2.4</span> ACS location update [1/1] </h3>
<div class="outline-text-3" id="text-2.4">

<ul>
<li>
<b>[X]</b> Parse URI / xmerl_tests:parse_URI_test


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> System tests </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1"><span class="section-number-3">3.1</span> Application state management [1/3] </h3>
<div class="outline-text-3" id="text-3.1">

<ul>
<li>
<b>[X]</b> GProc cookies OFO
<a href="http://rustyklophaus.com/articles/20090916-GProcErlangGlobalProcessRegistry.html">http://rustyklophaus.com/articles/20090916-GProcErlangGlobalProcessRegistry.html</a>

</li>
<li>
<b>[<span style="visibility:hidden;">X</span>]</b> ETS save

</li>
<li>
<b>[<span style="visibility:hidden;">X</span>]</b> Application:get_env/2 
oriv/sys.config

</li>
</ul>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Mirela Nicola
<a href="mailto:mirela_nikola@yahoo.com">&lt;mirela_nikola@yahoo.com&gt;</a>
</p>
<p class="date"> Date: 2013-03-07 Thu</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
